anachrocomputer/PIC32Tone/PIC32QuadTone.X/quadtone.c
/* quadtone --- play four tones on PIC32 dev board          2019-02-04 */
/* Copyright (c) 2019 John Honniball. All rights reserved              */

/*
 * Created: 2019-02-04 22:06
 */


// PIC32MX550F256L Configuration Bit Settings

// 'C' source line config statements

// DEVCFG3
// USERID = No Setting
#pragma config PMDL1WAY = OFF           // Peripheral Module Disable Configuration (Allow multiple reconfigurations)
#pragma config IOL1WAY = OFF            // Peripheral Pin Select Configuration (Allow multiple reconfigurations)
#pragma config FUSBIDIO = OFF           // USB USID Selection (Controlled by Port Function)
#pragma config FVBUSONIO = OFF          // USB VBUS ON Selection (Controlled by Port Function)

// DEVCFG2
#pragma config FPLLIDIV = DIV_2         // PLL Input Divider (2x Divider)
#pragma config FPLLMUL = MUL_20         // PLL Multiplier (20x Multiplier)
#pragma config UPLLIDIV = DIV_4         // USB PLL Input Divider (4x Divider)
#pragma config UPLLEN = ON              // USB PLL Enable (Enabled)
#pragma config FPLLODIV = DIV_4         // System PLL Output Clock Divider (PLL Divide by 4)

// DEVCFG1
#pragma config FNOSC = PRIPLL           // Oscillator Selection Bits (Primary Osc w/PLL (XT+,HS+,EC+PLL))
#pragma config FSOSCEN = OFF            // Secondary Oscillator Enable (Disabled)
#pragma config IESO = OFF               // Internal/External Switch Over (Disabled)
#pragma config POSCMOD = HS             // Primary Oscillator Configuration (HS osc mode)
#pragma config OSCIOFNC = OFF           // CLKO Output Signal Active on the OSCO Pin (Disabled)
#pragma config FPBDIV = DIV_1           // Peripheral Clock Divisor (Pb_Clk is Sys_Clk/1)
#pragma config FCKSM = CSDCMD           // Clock Switching and Monitor Selection (Clock Switch Disable, FSCM Disabled)
#pragma config WDTPS = PS1048576        // Watchdog Timer Postscaler (1:1048576)
#pragma config WINDIS = OFF             // Watchdog Timer Window Enable (Watchdog Timer is in Non-Window Mode)
#pragma config FWDTEN = OFF             // Watchdog Timer Enable (WDT Disabled (SWDTEN Bit Controls))
#pragma config FWDTWINSZ = WINSZ_25     // Watchdog Timer Window Size (Window Size is 25%)

// DEVCFG0
#pragma config JTAGEN = OFF             // JTAG Enable (JTAG Disabled)
#pragma config ICESEL = ICS_PGx2        // ICE/ICD Comm Channel Select (Communicate on PGEC2/PGED2)
#pragma config PWP = OFF                // Program Flash Write Protect (Disable)
#pragma config BWP = OFF                // Boot Flash Write Protect bit (Protection Disabled)
#pragma config CP = OFF                 // Code Protect (Protection Disabled)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>
#include <sys/attribs.h>
#include <stdio.h>
#include <math.h>
#include <stdlib.h>
#include <stdbool.h>


#define C5 (523)
#define D5 (587)
#define E5 (659)
#define F5 (698)
#define G5 (784)
#define B4 (494)
#define A4 (440)
#define G4 (392)
#define E4 (330)
#define C4 (262)

#define LED1        LATEbits.LATE6
#define LED2        LATEbits.LATE7
#define LED3        LATEbits.LATE1
#define LED4        LATAbits.LATA7
#define LED5        LATAbits.LATA6

#define UART_RX_BUFFER_SIZE  (128)
#define UART_RX_BUFFER_MASK (UART_RX_BUFFER_SIZE - 1)
#if (UART_RX_BUFFER_SIZE & UART_RX_BUFFER_MASK) != 0
#error UART_RX_BUFFER_SIZE must be a power of two and <= 256
#endif

#define UART_TX_BUFFER_SIZE  (128)
#define UART_TX_BUFFER_MASK (UART_TX_BUFFER_SIZE - 1)
#if (UART_TX_BUFFER_SIZE & UART_TX_BUFFER_MASK) != 0
#error UART_TX_BUFFER_SIZE must be a power of two and <= 256
#endif

struct UART_RX_BUFFER
{
    volatile uint8_t head;
    volatile uint8_t tail;
    uint8_t buf[UART_RX_BUFFER_SIZE];
};

struct UART_TX_BUFFER
{
    volatile uint8_t head;
    volatile uint8_t tail;
    uint8_t buf[UART_TX_BUFFER_SIZE];
};

struct UART_BUFFER
{
    struct UART_TX_BUFFER tx;
    struct UART_RX_BUFFER rx;
};

// UART buffers
static struct UART_BUFFER U4Buf;

volatile uint32_t MilliSeconds = 0;

volatile uint32_t StopTime[4];

volatile int SPINbytes = 0;
volatile uint8_t *SPIBuf = NULL;
volatile int SPIDummyReads = 0;


/* dally --- CPU busy-loop for crude time delay */

static void dally(const int loops)
{
    volatile int dally;
    
    for (dally = 0; dally < loops; dally++)
        ;
}


/* delayms --- busy-wait delay for given number of milliseconds */

static void delayms(const uint32_t interval)
{
    const uint32_t now = MilliSeconds;
    
    while ((MilliSeconds - now) < interval)
        ;
}


/* millis --- Arduino-like function to return milliseconds since start-up */

static uint32_t millis(void)
{
    return (MilliSeconds);
}


void __ISR(_TIMER_1_VECTOR, ipl2AUTO) Timer1Handler(void) 
{
    MilliSeconds++;
    
    //LATAINV = _LATA_LATA4_MASK; // Toggle P7 pin 6 (500Hz)
    
    IFS0CLR = _IFS0_T1IF_MASK;  // Clear Timer 1 interrupt flag
}

void __ISR(_TIMER_2_VECTOR, ipl2AUTO) Timer2Handler(void) 
{
    if (MilliSeconds >= StopTime[0])
    {
        StopTime[0] = 0;
        LATDCLR = _LATD_LATD0_MASK; // Zero RD0 on pin 72, P7 pin 14 (tone 1)
        IEC0CLR = _IEC0_T2IE_MASK;  // Disable Timer 2 interrupt
    }
    else
    {
        LATDINV = _LATD_LATD0_MASK; // Toggle RD0 on pin 72, P7 pin 14 (tone 1)
    }
    
    IFS0CLR = _IFS0_T2IF_MASK;  // Clear Timer 2 interrupt flag
}

void __ISR(_TIMER_3_VECTOR, ipl2AUTO) Timer3Handler(void) 
{
    if (MilliSeconds >= StopTime[1])
    {
        StopTime[1] = 0;
        LATDCLR = _LATD_LATD8_MASK; // Zero RD8 on pin 68, P7 pin 10 (tone 2)
        IEC0CLR = _IEC0_T3IE_MASK;  // Disable Timer 3 interrupt
    }
    else
    {
        LATDINV = _LATD_LATD8_MASK; // Toggle RD8 on pin 68, P7 pin 10 (tone 2)
    }
    
    IFS0CLR = _IFS0_T3IF_MASK;  // Clear Timer 3 interrupt flag
}

void __ISR(_TIMER_4_VECTOR, ipl2AUTO) Timer4Handler(void) 
{
    if (MilliSeconds >= StopTime[2])
    {
        StopTime[2] = 0;
        LATACLR = _LATA_LATA4_MASK; // Zero RA4 on pin 60, P7 pin 6 (tone 3)
        IEC0CLR = _IEC0_T4IE_MASK;  // Disable Timer 4 interrupt
    }
    else
    {
        LATAINV = _LATA_LATA4_MASK; // Toggle RA4 on pin 60, P7 pin 6 (tone 3)
    }
    
    IFS0CLR = _IFS0_T4IF_MASK;  // Clear Timer 4 interrupt flag
}

void __ISR(_TIMER_5_VECTOR, ipl2AUTO) Timer5Handler(void) 
{
    if (MilliSeconds >= StopTime[3])
    {
        StopTime[3] = 0;
        LATACLR = _LATA_LATA5_MASK; // Zero RA5 on pin 61, P7 pin 8 (tone 4)
        IEC0CLR = _IEC0_T5IE_MASK;  // Disable Timer 5 interrupt
    }
    else
    {
        LATAINV = _LATA_LATA5_MASK; // Toggle RA5 on pin 61, P7 pin 8 (tone 4)
    }
    
    IFS0CLR = _IFS0_T5IF_MASK;  // Clear Timer 5 interrupt flag
}

void __ISR(_SPI_3_VECTOR, ipl1AUTO) SPI3Handler(void) 
{
    volatile uint32_t junk;
    
    if (IFS2 & _IFS2_SPI3RXIF_MASK)
    {
        junk = SPI3BUF;
        SPIDummyReads--;
        
