anachrocomputer/PIC32Tone/PIC32QuadTone.X/quadtone.c
    TMR4 = 0x00;                // Clear Timer 4 counter
    PR4 = 1420;                 // Divisor for 880Hz
    
    T4CONbits.ON = 1;           // Enable Timer 4
    
    /* Configure Timer 5 for tone generation via interrupt */
    T5CONbits.TCKPS = 4;        // Timer 5 prescale: 16
    
    TMR5 = 0x00;                // Clear Timer 5 counter
    PR5 = 5681;                 // Divisor for 220Hz
    
    T5CONbits.ON = 1;           // Enable Timer 5
    
    /* Configure Timer 1 for millisecond timing */
    T1CONbits.TCKPS = 0;        // Timer 1 prescale: 1
    
    TMR1 = 0x00;                // Clear Timer 1 counter
    PR1 = 39999;                // Interrupt every 40000 ticks (1ms)
    
    T1CONbits.ON = 1;           // Enable Timer 1
    
    /* Configure interrupts */
    INTCONSET = _INTCON_MVEC_MASK; // Multi-vector mode
    
    IPC1bits.T1IP = 2;          // Timer 1 interrupt priority 2
    IPC1bits.T1IS = 1;          // Timer 1 interrupt sub-priority 1
    IFS0CLR = _IFS0_T1IF_MASK;  // Clear Timer 1 interrupt flag
    IEC0SET = _IEC0_T1IE_MASK;  // Enable Timer 1 interrupt
    
    IPC2bits.T2IP = 2;          // Timer 2 interrupt priority 2
    IPC2bits.T2IS = 0;          // Timer 2 interrupt sub-priority 0
    IFS0CLR = _IFS0_T2IF_MASK;  // Clear Timer 2 interrupt flag
    IEC0SET = _IEC0_T2IE_MASK;  // Enable Timer 2 interrupt
    
    IPC3bits.T3IP = 2;          // Timer 3 interrupt priority 2
    IPC3bits.T3IS = 1;          // Timer 3 interrupt sub-priority 1
    IFS0CLR = _IFS0_T3IF_MASK;  // Clear Timer 3 interrupt flag
    IEC0SET = _IEC0_T3IE_MASK;  // Enable Timer 3 interrupt
    
    IPC4bits.T4IP = 2;          // Timer 4 interrupt priority 2
    IPC4bits.T4IS = 2;          // Timer 4 interrupt sub-priority 2
    IFS0CLR = _IFS0_T4IF_MASK;  // Clear Timer 4 interrupt flag
    IEC0SET = _IEC0_T4IE_MASK;  // Enable Timer 4 interrupt
    
    IPC5bits.T5IP = 2;          // Timer 5 interrupt priority 2
    IPC5bits.T5IS = 3;          // Timer 5 interrupt sub-priority 3
    IFS0CLR = _IFS0_T5IF_MASK;  // Clear Timer 5 interrupt flag
    IEC0SET = _IEC0_T5IE_MASK;  // Enable Timer 5 interrupt
    
    for (i = 0; i < 4; i++)
    {
        StopTime[i] = 0;
    }
    
    __asm__("EI");              // Global interrupt enable
    
    UART4TxByte('\r');
    UART4TxByte('\n');
    
    while(1)
    {
        LED1 = 0;
        LED2 = 1;
        LED3 = 1;
        LED4 = 1;
        LED5 = 1;
        
        // Bar 1
        BeginNote(0, E5, 500);
        BeginNote(1, C5, 500);
        BeginNote(2, G4, 2000);
        BeginNote(3, C4, 2000);
        delayms(500);
        BeginNote(0, E5, 500);
        delayms(500);
        BeginNote(0, F5, 500);
        delayms(500);
        BeginNote(0, G5, 500);
        delayms(500);
        
        LED1 = 1;
        LED2 = 0;
        LED3 = 1;
        LED4 = 1;
        LED5 = 1;
        
        // Bar 2
        BeginNote(0, G5, 500);
        BeginNote(2, G4, 1000);
        delayms(500);
        BeginNote(0, F5, 500);
        delayms(500);
        BeginNote(0, E5, 500);
        BeginNote(2, G4, 1000);
        delayms(500);
        BeginNote(0, D5, 500);
        delayms(500);
        
        LED1 = 1;
        LED2 = 1;
        LED3 = 0;
        LED4 = 1;
        LED5 = 1;
        
        // Bar 3
        BeginNote(0, C5, 500);
        BeginNote(2, E4, 2000);
        BeginNote(2, G4, 2000);
        BeginNote(3, C4, 2000);
        delayms(500);
        BeginNote(0, C5, 500);
        delayms(500);
        BeginNote(0, D5, 500);
        delayms(500);
        BeginNote(0, E5, 500);
        delayms(500);
        
        LED1 = 1;
        LED2 = 1;
        LED3 = 1;
        LED4 = 0;
        LED5 = 1;
        
        // Bar 4
        BeginNote(0, E5, 750);
        BeginNote(2, G4, 1000);
        delayms(750);
        BeginNote(0, D5, 250);
        delayms(250);
        BeginNote(0, D5, 1000);
        BeginNote(1, B4, 1000);
        BeginNote(2, G4, 1000);
        delayms(1000);
        
        LED1 = 1;
        LED2 = 1;
        LED3 = 1;
        LED4 = 1;
        LED5 = 0;
        
        delayms(1000);
    }
}

